import os
import logging
import asyncio
from pymongo import MongoClient
from telegram.ext import MessageHandler, filters
from telegram import Update, InlineKeyboardButton, InlineKeyboardMarkup
from telegram.ext import (
    ApplicationBuilder,
    CommandHandler,
    CallbackQueryHandler,
    ContextTypes
)

# ================== إعداد MongoDB ==================
MONGO_URL = os.environ.get("MONGO_URL")

if not MONGO_URL:
    raise ValueError("MONGO_URL is missing")

client = MongoClient(MONGO_URL)
db = client["quiz_bot"]
users = db["users"]

# ================== لوج ==================
logging.basicConfig(
    format="%(asctime)s - %(name)s - %(levelname)s - %(message)s",
    level=logging.INFO
)

# ================== التوكن ==================
TOKEN = os.environ.get("TOKEN")
if not TOKEN:
    raise ValueError("TOKEN is missing")

# ================== الأدمن ==================
ADMIN_ID = 8491023024

# ================== قواعد البيانات ==================
def get_user(user_id):
    return users.find_one({"_id": user_id})

def create_user(user_id):
    users.update_one(
        {"_id": user_id},
        {
            "$setOnInsert": {
                "_id": user_id,
                "approved": False,
                "pending": True,
                "score": 0,
                "q_index": 0
            }
        },
        upsert=True
    )

def approve_user(user_id):
    users.update_one(
        {"_id": user_id},
        {"$set": {"approved": True, "pending": False}},
        upsert=True
    )

# ================== الفيديو ==================
INTRO_VIDEO = "BAACAgQAAxkBAAIG_GnmTG0PIxI5oVt3I9oK1G3n2XtBAAI7GwACj3k4U_ihISwgbvOoOwQ"

# ================== الصور ==================
# ================== الصور ==================
uploaded_images = {
"الهيكل العظمي": "AgACAgQAAxkBAAIC7mnjrd4qryTOyoW_z_xsNkEvFM7iAAIwDGsb4XYhU1NT2bwGdzhNAQADAgADbQADOwQ",
"عظام الوجه": "AgACAgQAAxkBAAIDgmnjuaxzSVnHSg-Ht5sh8MLSRxgDAAJEDGsb4XYhUyf_4zNepyt6AQADAgADbQADOwQ",
"مفصل العضد الكتفي": "AgACAgQAAxkBAAIDrGnj2XkC5s_14i-8Zr11ICic-ImxAAJjDGsb4XYhU7x_C70kw-VnAQADAgADbQADOwQ",
"مفاصل العمود الفقري": "AgACAgQAAxkBAAIDrmnj2cFsc9BTuUF_6SBSJ5AolzFXAAJkDGsb4XYhU52j6bbeUJdeAQADAgADbQADOwQ",
"عظام الطرف العلوي": "AgACAgQAAxkBAAIDsmnj2gsFww-fBb8XMXywean-d5bSAAJmDGsb4XYhU71hPZ-to5faAQADAgADeAADOwQ",
"عظام الطرف السفلي": "AgACAgQAAxkBAAIDtGnj2i6b24ki0cgork2CXiRUPyZkAAJnDGsb4XYhU-tRzckix1dGAQADAgADeAADOwQ",
"عظام الجمجمة": "AgACAgQAAxkBAAIDtmnj2kzpampZCzzZG1R3ukMhOA_LAAJoDGsb4XYhU90RtQhjryIZAQADAgADbQADOwQ",
"بنية العظم الطويل": "AgACAgQAAxkBAAIDuGnj2qP11IFHNmIsBybhHIJnHnhlAAJpDGsb4XYhU4jukApSAAF2JgEAAwIAA20AAzsE",
"القناة الفقرية": "AgACAgQAAxkBAAIDumnj2s3d7FdxX6ek83h2ICL058HGAAJqDGsb4XYhU44UTT9-9Q3TAQADAgADbQADOwQ",
"القفص الصدري": "AgACAgQAAxkBAAIDvGnj2wKHWoZd-Fnq6VTgtbr_26cXAAJrDGsb4XYhU6gEI1EyrwWmAQADAgADbQADOwQ",
"الفقرة": "AgACAgQAAxkBAAIDvmnj2y7tdQIvOj1m2vpCtZYG73CTAAJsDGsb4XYhUwAB9a5PVNtyWQEAAwIAA20AAzsE",
"العمود الفقري": "AgACAgQAAxkBAAIDwGnj2098LBlyy3stztvcZro8wYe8AAJtDGsb4XYhU2P4mddgYBUPAQADAgADbQADOwQ",
"الزنار الحوضي": "AgACAgQAAxkBAAIDwmnj22kphW_UdDwCxYEXZ1QEEvr6AAJuDGsb4XYhU9ARG08G-TgLAQADAgADbQADOwQ",
"الاربطة والاوتار": "AgACAgQAAxkBAAIDxGnj27EBbQ7NdocwG8BMMx-pXpz0AAJvDGsb4XYhU0SlG3BDNztZAQADAgADbQADOwQ",
}

# ================== بنك الأسئلة ==================
subjects = {
    "bio": {
        "u1_taaleel": [
            {
"question": "1. لماذا عظم الفك السفلي متحرك؟",
"options": [" لتسهيل التنفس"," لتسهيل المضغ والنطق "," لحماية الدماغ"],
"answer": " لتسهيل المضغ والنطق "
},



{
"question": "2. لماذا توجد فتحات عظمية في عظام القحف عند الرضيع؟",
"options": [" لتخفيف وزن الرأس"," لتسهيل التنفس","لتسمح لدماغ الرضيع بالنمو"],
"answer": "لتسمح لدماغ الرضيع بالنمو"
},



{
"question": "3. لماذا توجد أقراص غضروفية بين فقرات العمود الفقري؟",
"options": ["لمنع احتكاك الفقرات مع بعضها البعض"," لزيادة الطول"," لتقوية العضلات"],
"answer": "لمنع احتكاك الفقرات مع بعضها البعض"
},



{
"question": "4. لماذا يزداد طول رواد الفضاء؟",
"options": [" بسبب زيادة الكالسيوم"," بسبب غياب الجاذبية\n مما يقلل الضغط على الفقرات "," بسبب التمارين الرياضية"],
"answer": " بسبب غياب الجاذبية مما يقلل الضغط على الفقرات "
},



{
"question": "5. لماذا سميت الأضلاع السائبة بهذا الاسم؟",
"options": [" لأنها ضعيفة"," لأنها قصيرة"," لأنها لا تتصل مع عظم القص من الأمام "],
"answer": " لأنها لا تتصل مع عظم القص من الأمام "
},



{
"question": "6. لماذا لا يمكن ثني الساعد نحو الخلف؟",
"options": [" بسبب العضلات"," بسبب المفصل","لوجود نتوء مرفقي في نهاية الزند العليا"],
"answer": "لوجود نتوء مرفقي في نهاية الزند العليا"
},



{
"question": "7. لماذا لا يمكن ثني الساق نحو الأمام؟",
"options": [" بسبب الأربطة"," لوجود عظم الرضفة في مفصل الركبة "," بسبب العضلات"],
"answer": " لوجود عظم الرضفة في مفصل الركبة "
},



{
"question": "8. لماذا عدد العظام عند البالغ أقل من الطفل؟",
"options": [" لأن بعضها يتآكل"," لأن الجسم يفقد عظام"," لأن العديد منها يلتحم خلال النمو "],
"answer": " لأن العديد منها يلتحم خلال النمو "
},



{
"question": "9. لماذا توجد ثقوب في جسم العظم الطويل؟",
"options": [" لمرور الأوعية الدموية والأعصاب داخل العظم "," لتخفيف الوزن"," لتخزين الدهون"],
"answer": " لمرور الأوعية الدموية والأعصاب داخل العظم "
},



{
"question": "10. لماذا للهيكل العظمي دور في تكوين خلايا الدم؟",
"options": [" لأنه يخزن الدم"," لأنه يولد كريات الدم الحمراء والبيضاء والصفيحات "," لأنه ينقل الدم"],
"answer": " لأنه يولد كريات الدم الحمراء والبيضاء والصفيحات "
},
{
"question": "11. لماذا تتصف العظام بالصلابة والقساوة؟",
"options": [" لوجود الروابط الوثيقة بين أملاح الكالسيوم ومادة العظم "," بسبب العضلات"," لاحتوائها على ماء"],
"answer": " لوجود الروابط الوثيقة بين أملاح الكالسيوم ومادة العظم "
},



{
"question": "12. لماذا عظام القحف غير متحركة؟",
"options": [" لأنها صغيرة"," لأن المفاصل بينها ثابتة "," لأنها خفيفة"],
"answer": " لأن المفاصل بينها ثابتة "
},



{
"question": "13. لماذا فقرات العمود الفقري محدودة الحركة؟",
"options": [" لأنها ضعيفة"," لأن المفاصل بينها نصف متحركة "," لأنها كثيرة"],
"answer": " لأن المفاصل بينها نصف متحركة "
},



{
"question": "14. لماذا حركة المفصل العضدي الكتفي واسعة؟",
"options": [" لأنه ثابت"," لأنه مفصل متحرك "," لأنه صغير"],
"answer": " لأنه مفصل متحرك "
},



{
"question": "15. لماذا يحدث خلع المفصل؟",
"options": [" بسبب كسر العظم"," بسبب خروج العظم من مكانه الطبيعي "," بسبب ضعف العضلات"],
"answer": " بسبب خروج العظم من مكانه الطبيعي "
},



{
"question": "16. لماذا للسمحاق دور في جبر الكسور؟",
"options": [" لأنه يفرز مادة تساعد على وصل العظم المكسور "," لأنه صلب"," لأنه يحمي العظم"],
"answer": " لأنه يفرز مادة تساعد على وصل العظم المكسور "
},



{
"question": "17. لماذا يتوقف النمو الطولي عند عمر 18 سنة؟",
"options": [" بسبب نقص الغذاء"," بسبب تعظم غضاريف النمو "," بسبب قلة الحركة"],
"answer": " بسبب تعظم غضاريف النمو "
},



{
"question": "18. لماذا تسمى العضلات الملساء عضلات حشوية؟",
"options": [" لأنها قوية"," لوجودها في جدران الأحشاء (المعدة والأمعاء) "," لأنها سريعة"],
"answer": " لوجودها في جدران الأحشاء (المعدة والأمعاء) "
},



{
"question": "19. لماذا تسمى العضلات المخططة عضلات هيكلية؟",
"options": [" لأنها كبيرة"," لأنها بطيئة"," لأنها مرتبطة بالعظام في الهيكل العظمي "],
"answer": " لأنها مرتبطة بالعظام في الهيكل العظمي "
},



{
"question": "20. لماذا تعود العضلة إلى وضعها الطبيعي بعد الشد؟",
"options": [" لأنها تتمتع بخاصية المرونة "," بسبب الأعصاب"," بسبب الدم"],
"answer": " لأنها تتمتع بخاصية المرونة "
},



{
"question": "21. لماذا عضلات الرقبة والفك السفلي لا تتعب بسهولة؟",
"options": ["لأنها تتمتع بخاصية المقوية العضلية (تحافظ على تقلصها)","لأنها صغيرة","لأنها سريعة"],
"answer": "لأنها تتمتع بخاصية المقوية العضلية (تحافظ على تقلصها)"
},



{
"question": "22. لماذا تبقى الرأس منتصبة أثناء اليقظة؟",
"options": ["بسبب العظام","بسبب الأعصاب","لأن عضلات الرقبة تتمتع بخاصية المقوية العضلية"],
"answer": "لأن عضلات الرقبة تتمتع بخاصية المقوية العضلية"
},
{
"question": "23. كثرة التلافيف في قشرة المخ:",
"options": ["لتقليل حجم الدماغ","لزيادة مساحة سطح القشرة المخية (المادة الرمادية)",""],
"answer": "لزيادة مساحة سطح القشرة المخية (المادة الرمادية)"
},


{
"question": "24. أهمية السائل الدماغي الشوكي:",
"options": ["يعمل كوسادة مائية تحمي المراكز العصبية من الصدمات والضغط","لتغذية العظام فقط",""],
"answer": "يعمل كوسادة مائية تحمي المراكز العصبية من الصدمات والضغط"
},


{
"question": "25. التصاق الأم الحنون بقوة بالمراكز العصبية:",
"options": ["لنقل الغذاء والأكسجين إليها عبر أوعيتها الغزيرة","لتكوين العظام",""],
"answer": "لنقل الغذاء والأكسجين إليها عبر أوعيتها الغزيرة"
},


{
"question": "26. تسمية الغدة النخامية بسيدة الغدد:",
"options": ["لأنها تتحكم في الهضم","لأن هرموناتها تنظم عمل معظم الغدد الصماء الأخرى",""],
"answer": "لأن هرموناتها تنظم عمل معظم الغدد الصماء الأخرى"
},


{
"question": "27. أهمية اليود في الغذاء:",
"options": ["لزيادة قوة العضلات","لتكوين كريات الدم الحمراء",""],
"answer": "ضروري جداً لتركيب هرمون التيروكسين في الغدة الدرقية"
},


{
"question": "28. إفراز الأدرينالين في حالات الخوف:",
"options": ["لتقليل ضربات القلب","لتخزين الطاقة فقط",""],
"answer": "لزيادة نشاط القلب وتحويل الدم للأعضاء المهمة لمواجهة الخطر"
},


{
"question": "29. سرعة استجابة السيالة العصبية مقارنة بالهرمونات:",
"options": ["لأن السيالة تنتقل بسرعة عبر الألياف العصبية بينما الهرمونات ببطء عبر الدم","لأن الدم لا ينقل الهرمونات","لأن الهرمونات أسرع من الأعصاب"],
"answer": "لأن السيالة تنتقل بسرعة عبر الألياف العصبية بينما الهرمونات ببطء عبر الدم"
},



        ],

        "u1_images": [
{
"type": "image",
"image": "الهيكل العظمي",
"question": "1",
"options": ["الجمجمة (عظام الوجه + عظام القحف)","الهيكل المحوري","القص"],
"answer": "الهيكل المحوري"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "3",
"options": ["الجمجمة (عظام الوجه + عظام القحف)","القص","هيكل الجذع"],
"answer": "الجمجمة (عظام الوجه + عظام القحف)"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "5",
"options": ["هيكل الجذع","القص","الزنار الكتفي"],
"answer": "القص"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "8",
"options": ["الزنار الكتفي","الطرف العلوي","هيكل الجذع"],
"answer": "هيكل الجذع"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "4",
"options": ["الزنار الكتفي","الطرف العلوي","هيكل الجذع"],
"answer": "الزنار الكتفي"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "9",
"options": ["الزنار الكتفي","الهيكل الطرفي","الطرف العلوي"],
"answer": "الطرف العلوي"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "10",
"options": ["الطرف السفلي","الزنار الحوضي","الهيكل الطرفي"],
"answer": "الزنار الحوضي"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "11",
"options": ["الهيكل الطرفي","الطرف السفلي","الزنار الحوضي"],
"answer": "الطرف السفلي"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "2",
"options": ["الزنار الحوضي","الطرف السفلي","الهيكل الطرفي"],
"answer": "الهيكل الطرفي"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "6",
"options": ["العمود الفقري","الاضلاع","الهيكل الطرفي"],
"answer": "الاضلاع"
},
{
"type": "image",
"image": "الهيكل العظمي",
"question": "7",
"options": ["العمود الفقري","الهيكل الطرفي","الاضلاع"],
"answer": "العمود الفقري"
},

{
"type": "image",
"image": "عظام الوجه",
"question": "2",
"options": [" الفك السفلي","عظام جوف الحجاج","الفك العلوي"],
"answer": "عظام جوف الحجاج"
},
{
"type": "image",
"image": "عظام الوجه",
"question": "1",
"options": ["عظام جوف الحجاج","عظام الانف"," الفك السفلي"],
"answer": "عظام الانف"
},

{
"type": "image",
"image": "مفصل العضد الكتفي",
"question": "1",
"options": ["عظم لوح الكتف","عظم العضد","عظم الترقوة"],
"answer": "عظم لوح الكتف"
},

{
"type": "image",
"image": "مفاصل العمود الفقري",
"question": "7",
"options": ["النخاع الشوكي","جسم الفقرة","القرص الغضروفي"],
"answer": "القرص الغضروفي"
},

{
"type": "image",
"image": "عظام الطرف العلوي",
"question": "16",
"options": ["عظم الزند","عظم العضد","عظم الكعبرة"],
"answer": "عظم الكعبرة"
},

{
"type": "image",
"image": "عظام الطرف العلوي",
"question": "19",
"options": ["اليد","الساعد","عظام السلاميات"],
"answer": "عظام السلاميات"
},




{
"type": "image",
"image": "عظام الطرف العلوي",
"question": "15",
"options": ["عظم العضد","عظم الزند","عظم الكعبرة"],
"answer": "عظم الزند"
},

{
"type": "image",
"image": "عظام الطرف السفلي",
"question": "4",
"options": ["عظم الرضفة","عظم الورك","عظم الفخد"],
"answer": "عظم الرضفة"
},

{
"type": "image",
"image": "عظام الطرف السفلي",
"question": "5",
"options": ["عظم الظنبوب","عظم الشظية","عظم الفخد"],
"answer": "عظم الظنبوب"
},

{
"type": "image",
"image": "عظام الطرف السفلي",
"question": "10",
"options": ["القدم","الساق","عظم الورك"],
"answer": "الساق"
},

{
"type": "image",
"image": "عظام الجمجمة",
"question": "3",
"options": ["العظم الصدغي","العظم الجداري","العظم القفوي"],
"answer": "العظم الصدغي"
},
{
"type": "image",
"image": "عظام الجمجمة",
"question": "4",
"options": ["العظم القفوي","العظم الجداري","العظم الصدغي"],
"answer": "العظم القفوي"
},

{
"type": "image",
"image": "بنية العظم الطويل",
"question": "3",
"options": ["المشاشة","نقي العظم","نسيج عظمي كثيف"],
"answer": "نقي العظم"
},

{
"type": "image",
"image": "القناة الفقرية",
"question": "5",
"options": ["النتوء الجانبي","قرص غضروفي","النتوء الشوكي"],
"answer": "النتوء الشوكي"
},

{
"type": "image",
"image": "القفص الصدري",
"question": "5",
"options": ["الاضلاع","الاضلاع السائبة","العمود الفقري"],
"answer": "الاضلاع السائبة"
},

{
"type": "image",
"image": "القفص الصدري",
"question": "2",
"options": ["عظم القص","الاضلاع","العمود الفقري"],
"answer": "عظم القص"
},

{
"type": "image",
"image": "الفقرة",
"question": "5",
"options": ["سطح مفصلي","نتوء جانبي","ثقب فقري"],
"answer": "نتوء جانبي"
},

{
"type": "image",
"image": "الفقرة",
"question": "3",
"options": ["ثقب فقري","نتوء شوكي","سطح مفصلي"],
"answer": "سطح مفصلي"
},

{
"type": "image",
"image": "العمود الفقري",
"question": "5",
"options": ["الفقرات العصعصية","الفقرات الظهرية","الفقرات القطنية"],
"answer": "الفقرات العصعصية"
},

{
"type": "image",
"image": "العمود الفقري",
"question": "4",
"options": ["الفقرات القطنية","الفقرات العجزية","الفقرات الظهرية"],
"answer": "الفقرات العجزية"
},

{
"type": "image",
"image": "الزنار الحوضي",
"question": "6",
"options": ["العصعص","العظم العاني","العجز"],
"answer": "العظم العاني"
},

{
"type": "image",
"image": "الاربطة والاوتار",
"question": "2",
"options": ["اوتار","عضلة","اربطة"],
"answer": "اربطة"
},


        ],
        "u1_where": [
{
"question": "1. أين يقع النتوء المرفقي؟",
"options": ["في عظم الفخذ","في نهاية عظم الزند العليا","في عظم العضد"],
"answer": "في نهاية عظم الزند العليا"
},



{
"question": "2. أين يوجد عظم الرضفة؟",
"options": ["في مفصل الكتف","في مفصل الركبة","في الكاحل"],
"answer": "في مفصل الركبة"
},



{
"question": "3. أين يوجد عظم الكعبرة وعظم الزند؟",
"options": ["في الساق","في الجمجمة","في الساعد ضمن الطرف العلوي"],
"answer": "في الساعد ضمن الطرف العلوي"
},



{
"question": "4. أين يوجد عظم الظنبوب وعظم الشظية؟",
"options": ["في الذراع","في الساق ضمن الطرف السفلي","في الصدر"],
"answer": "في الساق ضمن الطرف السفلي"
},



{
"question": "5. ما هي المشاشتان؟",
"options": ["عضلات","نهايتان منتفختان للعظم الطويل","أربطة"],
"answer": "نهايتان منتفختان للعظم الطويل"
},



{
"question": "6. أين يقع جسم العظم؟",
"options": ["في نهايات العظم","بين المشاشتين (القسم المتوسط)","خارج العظم"],
"answer": "بين المشاشتين (القسم المتوسط)"
},



{
"question": "7. أين توجد النتوءات؟",
"options": ["على سطح الجلد","داخل العضلات","على جسم العظم"],
"answer": ""
},



{
"question": "8. أين توجد الثقوب في العظم؟",
"options": ["في الجلد","في القلب","على جسم العظم"],
"answer": ""
},



{
"question": "9. أين يوجد السمحاق؟",
"options": ["داخل العظم","يغطي جسم العظم","داخل العضلات"],
"answer": "يغطي جسم العظم"
},



{
"question": "10. أين يوجد النسيج العظمي الكثيف؟",
"options": ["خارج العظم","في الجلد","يلي السمحاق في جسم العظم الطويل"],
"answer": "يلي السمحاق في جسم العظم الطويل"
},



{
"question": "11. أين توجد القناة المركزية؟",
"options": ["في الجلد","ضمن النسيج العظمي الكثيف","في العضلات"],
"answer": "ضمن النسيج العظمي الكثيف"
},



{
"question": "12. أين يوجد نقي العظم؟",
"options": ["في القلب","في الدم","داخل القناة المركزية والنسيج الإسفنجي"],
"answer": "داخل القناة المركزية والنسيج الإسفنجي"
},



{
"question": "13. أين يوجد النسيج العظمي الإسفنجي؟",
"options": ["في المشاشتين","في الجلد","في العضلات"],
"answer": "في المشاشتين"
},



{
"question": "14. أين يوجد النسيج الغضروفي؟",
"options": ["يستر المشاشتين","في الجلد","في القلب"],
"answer": "يستر المشاشتين"
},



{
"question": "15. أين توجد غضاريف النمو الطولي؟",
"options": ["بين جسم العظم والمشاشتين","في العضلات","في الجلد"],
"answer": "بين جسم العظم والمشاشتين"
},



{
"question": "16. أين توجد العضلات الملساء (الحشوية)؟",
"options": ["في جدران الأحشاء","في العظام","في الجلد"],
"answer": "في جدران الأحشاء"
},



{
"question": "17. أين توجد العضلات المخططة (الهيكلية)؟",
"options": ["في القلب","تستند على الهيكل العظمي","في المعدة"],
"answer": "تستند على الهيكل العظمي"
},



{
"question": "18. حدد موقع النخاع الشوكي:",
"options": ["في الجمجمة","في تجويف البطن","في القناة الفقرية الناتجة عن تتالي الثقوب الفقرية"],
"answer": "في القناة الفقرية الناتجة عن تتالي الثقوب الفقرية"
},


{
"question": "19. حدد موقع السمحاق:",
"options": ["طبقة تغطي الدماغ","طبقة ليفية تغطي جسم العظم الطويل","داخل المفاصل"],
"answer": "طبقة ليفية تغطي جسم العظم الطويل"
},


{
"question": "20. حدد موقع غضاريف النمو:",
"options": ["بين جسم العظم ومشاشيته","داخل القحف","بين العظام في المفاصل"],
"answer": "بين جسم العظم ومشاشيته"
},


{
"question": "21. حدد موقع المخيخ:",
"options": ["خلف وأسفل المخ","داخل النخاع الشوكي","أمام المخ"],
"answer": "خلف وأسفل المخ"
},


{
"question": "22. حدد موقع البصلة السيسائية:",
"options": ["داخل القحف الأمامي فقط","فوق المخ","أمام وأسفل المخيخ وتتصل بالنخاع الشوكي"],
"answer": "أمام وأسفل المخيخ وتتصل بالنخاع الشوكي"
},


{
"question": "23. حدد موقع الجسم الثفني:",
"options": ["في النخاع الشوكي","في المخيخ","في قاع الشق الأمامي الخلفي بين نصفي كرة المخ"],
"answer": "في قاع الشق الأمامي الخلفي بين نصفي كرة المخ"
},


{
"question": "24. حدد موقع مثلث المخ:",
"options": ["في جذع الدماغ","صفيحة بيضاء تحت الجسم الثفني","في القشرة المخية"],
"answer": "صفيحة بيضاء تحت الجسم الثفني"
},


{
"question": "25. حدد موقع قناة السيساء:",
"options": ["في مركز المادة الرمادية للنخاع الشوكي","في المخيخ","في القناة الفقرية خارج النخاع"],
"answer": "في مركز المادة الرمادية للنخاع الشوكي"
},


{
"question": "26. حدد موقع الحيز تحت العنكبوتي:",
"options": ["بين غشاء العنكبوتي والأم الحنون (يحتوي السائل الخارجي)","داخل العظام","بين العظم والجلد"],
"answer": "بين غشاء العنكبوتي والأم الحنون (يحتوي السائل الخارجي)"
},


{
"question": "27. حدد موقع الباحة المحركة:",
"options": ["في الفص الصدغي","في الفص القفوي","في الفص الجبهي أمام شق رولاندو"],
"answer": "في الفص الجبهي أمام شق رولاندو"
},


{
"question": "28. حدد موقع الباحة البصرية:",
"options": ["في المخيخ","في الفص الجبهي","في الفص القفوي"],
"answer": "في الفص القفوي"
},


{
"question": "29. حدد موقع الباحة السمعية:",
"options": ["في الفص الجبهي","في النخاع الشوكي","في الفص الصدغي"],
"answer": "في الفص الصدغي"
},


{
"question": "30. حدد موقع العقدة الشوكية:",
"options": ["على الجذر الأمامي الحركي","داخل الدماغ","على الجذر الخلفي الحسي للعصب الشوكي"],
"answer": "على الجذر الخلفي الحسي للعصب الشوكي"
},


{
"question": "31. حدد موقع الغدة النخامية:",
"options": ["في الرقبة","في الصدر","على الوجه السفلي للدماغ"],
"answer": "على الوجه السفلي للدماغ"
},


{
"question": "32. حدد موقع الغدة الدرقية:",
"options": ["تحيط بالحنجرة وأعلى الرغامي","في الدماغ","في البطن"],
"answer": "تحيط بالحنجرة وأعلى الرغامي"
},


{
"question": "33. حدد موقع الغدد جارات الدرق:",
"options": ["أربع غدد تلتصق بالسطح الخلفي للغدة الدرقية","في القلب","داخل الكبد"],
"answer": "أربع غدد تلتصق بالسطح الخلفي للغدة الدرقية"
},


{
"question": "34. حدد موقع جزر لانغرهانس:",
"options": ["في الكبد","في الدماغ","في مؤخرة المعثكلة (البنكرياس)"],
"answer": "في مؤخرة المعثكلة (البنكرياس)"
},


{
"question": "35. حدد موقع الغدتين الكظريتين:",
"options": ["داخل المثانة","في الرقبة","فوق الكليتين مباشرة"],
"answer": "فوق الكليتين مباشرة"
},


{
"question": "36. حدد موقع الغدة الصنوبرية:",
"options": ["في المعدة","تقع داخل الدماغ","في النخاع الشوكي"],
"answer": "تقع داخل الدماغ"
},
        ],
        "u1_level": [
{
"question": "1.بنية العظم من الخارج للداخل",
"options": ["1- السمحاق، 2- نسيج عظمي كثيف، 3- قناة مركزية","2- نسيج عظمي كثيف، 1- السمحاق، 3- قناة مركزية","3- قناة مركزية، 2- نسيج عظمي كثيف،\n 1- السمحاق"],
"answer": "1- السمحاق، 2- نسيج عظمي كثيف، 3- قناة مركزية"
},



{
"question": "2.أغشية السحايا من الخارج للداخل",
"options": ["2- الغشاء العنكبوتي، 1- الأم الجافية، 3- الأم الحنون","1- الأم الجافية، 2- الغشاء العنكبوتي، 3- الأم الحنون","3- الأم الحنون، 2- الغشاء العنكبوتي، 1- الأم الجافية"],
"answer": "1- الأم الجافية، 2- الغشاء العنكبوتي، 3- الأم الحنون"
},



{
"question": "3.انتقال السيالة في العصبون",
"options": ["1- استطالات هيولية، 2- جسم الخلية، 3- المحور، 4- الأزرار","2- جسم الخلية، 1- استطالات هيولية، 4- الأزرار، 3- المحور","3- المحور، 2- جسم الخلية، 1- استطالات هيولية، 4- الأزرار"],
"answer": "1- استطالات هيولية، 2- جسم الخلية، 3- المحور، 4- الأزرار"
},



{
"question": "4.عناصر القوس الانعكاسية",
"options": ["1- مستقبل حسي، 2- عصب حسي، 3- مركز عصبي، 4- عصب محرك، 5- عضو منفذ","2- عصب حسي، 1- مستقبل حسي، 3- مركز عصبي، 5- عضو منفذ، 4- عصب محرك","5- عضو منفذ، 4- عصب محرك، 3- مركز عصبي، 2- عصب حسي، 1- مستقبل حسي"],
"answer": "1- مستقبل حسي، 2- عصب حسي، 3- مركز عصبي، 4- عصب محرك، 5- عضو منفذ"
},



{
"question": "5.فقرات العمود الفقري من الأعلى",
"options": ["1- رقبيّة، 2- ظهريّة، 3- قطنيّة، 4- عجزيّة، 5- عصعصيّة","2- ظهريّة، 1- رقبيّة، 3- قطنيّة، 4- عجزيّة، 5- عصعصيّة","5- عصعصيّة، 4- عجزيّة، 3- قطنيّة، 2- ظهريّة، 1- رقبيّة"],
"answer": "1- رقبيّة، 2- ظهريّة، 3- قطنيّة، 4- عجزيّة، 5- عصعصيّة"
},



{
"question": "6.بنية العصب من الخارج للداخل",
"options": ["2- غلاف الحزمة، 3- ليف عصبي، 1- غمد العصب","1- غمد العصب، 2- غلاف الحزمة، 3- ليف عصبي","3- ليف عصبي، 1- غمد العصب، 2- غلاف الحزمة"],
"answer": "1- غمد العصب، 2- غلاف الحزمة، 3- ليف عصبي"
},



{
"question": "7.ترتيب شقوق المخ حسب العمق",
"options": ["2- شق رولاندو وسيلفيوس، 1- الشق الأمامي الخلفي","1- الشق الأمامي الخلفي، 2- شق رولاندو وسيلفيوس","1- الشق الأمامي الخلفي، 1- الشق الأمامي الخلفي"],
"answer": "2- شق رولاندو وسيلفيوس، 1- الشق الأمامي الخلفي"
},



{
"question": "8.نمو العظام طولياً",
"options": ["1- انقسام خلايا غضروف النمو، 2- تحول الغضروف لعظم","2- تحول الغضروف لعظم، 1- انقسام خلايا غضروف النمو","2- تحول الغضروف لعظم، 2- تحول الغضروف لعظم"],
"answer": "1- انقسام خلايا غضروف النمو، 2- تحول الغضروف لعظم"
},



{
"question": "9.عمل الهرمون",
"options": ["1- إفراز من الغدة، 2- انتقال بالدم، 3- تأثير في العضو المستهدف","2- انتقال بالدم، 1- إفراز من الغدة، 3- تأثير في العضو المستهدف","3- تأثير في العضو المستهدف، 2- انتقال بالدم، 1- إفراز من الغدة"],
"answer": "1- إفراز من الغدة، 2- انتقال بالدم، 3- تأثير في العضو المستهدف"
},



{
"question": "10.ترتيب عظام الطرف العلوي",
"options": ["1- عظم العضد، 2- الساعد (زند وكعبرة)، 3- اليد","2- الساعد، 1- عظم العضد، 3- اليد","3- اليد، 2- الساعد، 1- عظم العضد"],
"answer": "1- عظم العضد، 2- الساعد (زند وكعبرة)، 3- اليد"
},



{
"question": "11.أقسام الدماغ من الأعلى للأسفل",
"options": ["1- المخ، 2- المخيخ، 3- البصلة السيسائية","2- المخيخ، 1- المخ، 3- البصلة السيسائية","3- البصلة السيسائية، 2- المخيخ، 1- المخ"],
"answer": "1- المخ، 2- المخيخ، 3- البصلة السيسائية"
},



{
"question": "12.توزيع الأضلاع",
"options": ["1- أضلاع حقيقية (7 أشفاع)، 2- كاذبة (3)، 3- سائبة (2.✓","2- كاذبة (3)، 1- حقيقية (7)، 3- سائبة (2)","3- سائبة (2)، 2- كاذبة (3)، 1- حقيقية (7)"],
"answer": "1- أضلاع حقيقية (7 أشفاع)، 2- كاذبة (3)، 3- سائبة (2.✓"
},



{
"question": "13.نشوء الفعل المنعكس",
"options": ["1- تنبيه المستقبل، 2- سيالة حسية، 3- معالجة في النخاع، 4- سيالة محركة، 5- تقلص العضلة","2- سيالة حسية، 1- تنبيه المستقبل، 3- معالجة في النخاع، 5- تقلص العضلة، 4- سيالة محركة","5- تقلص العضلة، 4- سيالة محركة، 3- معالجة في النخاع، 2- سيالة حسية، 1- تنبيه المستقبل"],
"answer": "1- تنبيه المستقبل، 2- سيالة حسية، 3- معالجة في النخاع، 4- سيالة محركة، 5- تقلص العضلة"
},



{
"question": "14.أقسام الهيكل العظمي",
"options": ["1- هيكل محوري، 2- هيكل طرفي","2- هيكل طرفي، 1- هيكل محوري","1- هيكل محوري، 1- هيكل محوري"],
"answer": "1- هيكل محوري، 2- هيكل طرفي"
},



{
"question": "15.بنية السطح العلوي للمخ",
"options": ["1- نصفي كرة مخية، 2- شق أمامي خلفي، 3- تلافيف وشقوق","2- شق أمامي خلفي، 1- نصفي كرة مخية، 3- تلافيف وشقوق","3- تلافيف وشقوق، 2- شق أمامي خلفي، 1- نصفي كرة مخية"],
"answer": "1- نصفي كرة مخية، 2- شق أمامي خلفي، 3- تلافيف وشقوق"
},



{
"question": "16.ترتيب عظام القحف",
"options": ["1- جبهي، 2- جداري، 3- قفوي، 4- صدغي","2- جداري، 1- جبهي، 4- صدغي، 3- قفوي","3- قفوي، 4- صدغي، 2- جداري، 1- جبهي"],
"answer": "1- جبهي، 2- جداري، 3- قفوي، 4- صدغي"
},



{
"question": "17.انقسام خلايا السمحاق",
"options": ["1- انقسام الخلايا، 2- تكوين طبقات عظمية جديدة عرضياً","2- تكوين طبقات عظمية، 1- انقسام الخلايا","2- تكوين طبقات عظمية، 2- تكوين طبقات عظمية"],
"answer": "1- انقسام الخلايا، 2- تكوين طبقات عظمية جديدة عرضياً"
},



{
"question": "18.ترتيب الأزرار النهائية",
"options": ["1- نهاية تفرعات المحور، 2- انتفاخات أزرار","2- انتفاخات أزرار، 1- نهاية تفرعات المحور","1- نهاية تفرعات المحور، 1- نهاية تفرعات المحور"],
"answer": "1- نهاية تفرعات المحور، 2- انتفاخات أزرار"
},



{
"question": "19.بنية النسيج العصبي",
"options": ["1- عصبونات، 2- خلايا دبقية","2- خلايا دبقية، 1- عصبونات","1- عصبونات، 1- عصبونات"],
"answer": "1- عصبونات، 2- خلايا دبقية"
},



{
"question": "20.استجابة البنكرياس لارتفاع السكر",
"options": ["1- تنبيه جزر لانغرهانس، 2- إفراز أنسولين، 3- تخزين السكر كغليكوجين","2- إفراز أنسولين، 1- تنبيه جزر لانغرهانس، 3- تخزين السكر كغليكوجين","3- تخزين السكر كغليكوجين، 2- إفراز أنسولين، 1- تنبيه جزر لانغرهانس"],
"answer": "1- تنبيه جزر لانغرهانس، 2- إفراز أنسولين، 3- تخزين السكر كغليكوجين"
},
  
        ],
        "u1_result1": [
{
"question": "1. ماذا ينتج عن غياب الجاذبية لرواد الفضاء؟",
"options": [" زيادة طولهم من 2 إلى 5 سم"," نقص طولهم بسبب الضغط"," ثبات الطول دون تغيير"],
"answer": " زيادة طولهم من 2 إلى 5 سم"
},



{
"question": "2. ماذا ينتج عن انقسام خلايا السمحاق؟",
"options": [" النمو الطولي للعظام"," النمو العرضي للعظام"," توقف نمو العظام"],
"answer": " النمو العرضي للعظام"
},



{
"question": "3. ماذا ينتج عن انقسام خلايا غضاريف النمو؟",
"options": [" النمو العرضي للعظام"," النمو الطولي للعظام"," تكلس العظم فقط"],
"answer": " النمو الطولي للعظام"
},



{
"question": "4. ماذا ينتج عن تعظم غضاريف النمو عند سن 18؟",
"options": [" استمرار النمو الطولي"," توقف النمو الطولي للإنسان"," زيادة النمو العرضي فقط"],
"answer": " توقف النمو الطولي للإنسان"
},



{
"question": "5. ماذا ينتج عن تنبيه الليف العصبي بمنبه ما؟",
"options": [" تشكل السيالة العصبية"," توقف السيالة العصبية"," تحلل الليف العصبي"],
"answer": " تشكل السيالة العصبية"
},



{
"question": "6. ماذا ينتج عن تكرار المعلومات وحفظها؟",
"options": [" ضعف الذاكرة"," تنشيط الذاكرة وتجنب النسيان"," فقدان المعلومات"],
"answer": " تنشيط الذاكرة وتجنب النسيان"
},



{
"question": "7. ماذا ينتج عن استئصال المخيخ عند الطيور؟",
"options": [" فقدان الإبصار"," فقدان التوازن والتمايل في المشي"," شلل كامل للجسم"],
"answer": " فقدان التوازن والتمايل في المشي"
},



{
"question": "8. ماذا ينتج عن قطع الجذر الخلفي الحسي للعصب الشوكي؟",
"options": [" شلل العضلات"," فقدان الإحساس في المنطقة الموافقة"," زيادة الحركة"],
"answer": " فقدان الإحساس في المنطقة الموافقة"
},



{
"question": "9. ماذا ينتج عن قطع الجذر الأمامي المحرك للعصب الشوكي؟",
"options": [" فقدان الإحساس"," شلل العضلات المرتبطة به"," زيادة الحساسية"],
"answer": " شلل العضلات المرتبطة به"
},



{
"question": "10. ماذا ينتج عن تأثير الجملة الودية في حدقة العين؟",
"options": [" تضيق حدقة العين"," توسع حدقة العين"," ثبات حجم الحدقة"],
"answer": " توسع حدقة العين"
},



{
"question": "11. ماذا ينتج عن زيادة إفراز هرمون النمو قبل البلوغ؟",
"options": [" القزامة"," حالة العملقة"," توقف النمو"],
"answer": " حالة العملقة"
},



{
"question": "12. ماذا ينتج عن نقص إفراز هرمون النمو قبل البلوغ؟",
"options": [" حالة القزامة"," العملقة"," تضخم العظام"],
"answer": " حالة القزامة"
},



{
"question": "13. ماذا ينتج عن زيادة إفراز هرمون النمو بعد البلوغ؟",
"options": [" تضخم غير متناسق لعظام الوجه والأطراف"," توقف النمو"," نقص في حجم العظام"],
"answer": " تضخم غير متناسق لعظام الوجه والأطراف"
},



{
"question": "14. ماذا ينتج عن نقص إفراز الأنسولين؟",
"options": [" انخفاض سكر الدم"," ارتفاع سكر الدم والإصابة بالسكري"," ثبات مستوى السكر"],
"answer": " ارتفاع سكر الدم والإصابة بالسكري"
},



{
"question": "15. ماذا ينتج عن زيادة إفراز التيروكسين؟",
"options": [" زيادة الوزن"," نقص في الوزن وزيادة في إنتاج الطاقة"," توقف إنتاج الطاقة"],
"answer": " نقص في الوزن وزيادة في إنتاج الطاقة"
},



{
"question": "16. ماذا ينتج عن نقص إفراز التيروكسين؟",
"options": [" نقص الوزن"," زيادة الوزن وعدم القدرة على مقاومة البرد"," زيادة الطاقة"],
"answer": " زيادة الوزن وعدم القدرة على مقاومة البرد"
},



{
"question": "17. ماذا ينتج عن نقص إفراز الكورتيزول؟",
"options": [" ارتفاع ضغط الدم"," الإصابة بداء أديبسون والوهن العام"," زيادة الطاقة"],
"answer": " الإصابة بداء أديبسون والوهن العام"
},



{
"question": "18. ماذا ينتج عن زيادة إفراز الباراثورمون؟",
"options": [" تقوية العظام"," سحب الكالسيوم من العظام وحدوث الهشاشة"," زيادة الكالسيوم في العظام"],
"answer": " سحب الكالسيوم من العظام وحدوث الهشاشة"
},



{
"question": "19. ماذا ينتج عن إفراز هرمون الميلاتونين؟",
"options": [" زيادة النشاط العضلي"," تنظيم الساعة البيولوجية للجسم"," رفع ضغط الدم"],
"answer": " تنظيم الساعة البيولوجية للجسم"
},



{
"question": "20. ماذا ينتج عن تنبيه العضلة من قبل عصبها؟",
"options": [" ارتخاء العضلة"," تقلص العضلة وقصر طولها وزيادة قطرها"," موت العضلة"],
"answer": " تقلص العضلة وقصر طولها وزيادة قطرها"
},



{
"question": "21. ماذا ينتج عن اختلاف المادة الرمادية والبيضاء في المخ؟",
"options": [" الرمادية محيطية والبيضاء مركزية"," الرمادية مركزية والبيضاء محيطية"," كلاهما مركزية"],
"answer": " الرمادية محيطية والبيضاء مركزية"
},



{
"question": "22. ماذا ينتج عن اختلاف المادة الرمادية والبيضاء في النخاع؟",
"options": [" الرمادية محيطية والبيضاء مركزية"," الرمادية مركزية والبيضاء محيطية"," لا يوجد فرق"],
"answer": " الرمادية مركزية والبيضاء محيطية"
},



{
"question": "23. ماذا ينتج عن اختلاف العضلات الملساء والمخططة؟",
"options": [" الملساء إرادية والمخططة لا إرادية"," الملساء لاإرادية والمخططة إرادية"," كلاهما إرادي"],
"answer": " الملساء لاإرادية والمخططة إرادية"
},



{
"question": "24. ماذا ينتج عن اختلاف السمحاق وغضاريف النمو؟",
"options": [" السمحاق للنمو العرضي وغضاريف النمو للطولي"," السمحاق للطولي وغضاريف للنمو العرضي"," كلاهما للنمو الطولي"],
"answer": " السمحاق للنمو العرضي وغضاريف النمو للطولي"
},



{
"question": "25. ماذا ينتج عن اختلاف وظيفة الأوتار والأربطة؟",
"options": [" الأوتار تربط عظم بعظم"," الأوتار عضلة بعظم والأربطة عظم بعظم"," الأربطة عضلة بعظم"],
"answer": " الأوتار عضلة بعظم والأربطة عظم بعظم"
},



{
"question": "26. ماذا ينتج عن اختلاف المفاصل الثابتة والمتحركة؟",
"options": [" الثابتة.الركبة. والمتحركة.الجمجمة."," الثابتة.الجمجمة. والمتحركة.الركبة."," كلاهما متحرك"],
"answer": " الثابتة.الجمجمة. والمتحركة.الركبة."
},



{
"question": "27. ماذا ينتج عن تأثير الجملة الودية وقرب الودية على حدقة العين؟",
"options": [" الودية تضيقها وقرب الودية توسعها"," الودية توسعها وقرب الودية تضيقها"," كلاهما يوسعها"],
"answer": " الودية توسعها وقرب الودية تضيقها"
},



{
"question": "28. ماذا ينتج عن اختلاف الأعصاب الدماغية والشوكية؟",
"options": [" الدماغية 31 والشوكية 12"," الدماغية 12 شفعاً والشوكية 31 شفعاً"," كلاهما 12"],
"answer": " الدماغية 12 شفعاً والشوكية 31 شفعاً"
},



{
"question": "29. ماذا ينتج عن تأثير الأنسولين والغلوكاغون على السكر؟",
"options": [" الأنسولين يرفعه والغلوكاغون يخفضه"," الأنسولين يخفضه والغلوكاغون يرفعه"," كلاهما يرفعه"],
"answer": " الأنسولين يخفضه والغلوكاغون يرفعه"
},



{
"question": "30. ماذا ينتج عن اختلاف الغدد الصماء والمفتوحة؟",
"options": [" الصماء عبر قنوات والمفتوحة في الدم"," الصماء في الدم مباشرة والمفتوحة عبر قنوات"," كلاهما عبر قنوات"],
"answer": " الصماء في الدم مباشرة والمفتوحة عبر قنوات"
},
        ],
        "u1_function": [
{
"question": "1. ما هي وظيفة عظام القحف؟",
"options": [" حماية القلب"," حماية الدماغ"," تكوين خلايا الدم"],
"answer": " حماية الدماغ"
},



{
"question": "2. ما هي وظيفة القفص الصدري؟",
"options": [" حماية القلب والرئتين"," نقل السيالة العصبية"," حماية الدماغ"],
"answer": " حماية القلب والرئتين"
},



{
"question": "3. ما هي وظيفة نقي العظم الأحمر؟",
"options": [" نقل الأكسجين فقط"," دعم العضلات"," تكوين خلايا الدم"],
"answer": " تكوين خلايا الدم"
},



{
"question": "4. ما هي وظيفة الأوتار؟",
"options": [" تغذية العصبونات"," تربط العضلات بالعظام وتساعد في تحريكها"," تربط عظم بعظم"],
"answer": " تربط العضلات بالعظام وتساعد في تحريكها"
},



{
"question": "5. ما هي وظيفة المخ؟",
"options": [" مركز الإحساس الشعوري والأفعال الإرادية والذكاء"," تنظيم التنفس فقط"," تخزين الكالسيوم"],
"answer": " مركز الإحساس الشعوري والأفعال الإرادية والذكاء"
},



{
"question": "6. ما هي وظيفة المخيخ؟",
"options": [" إفراز الهرمونات"," تنسيق التقلصات العضلية وضمان توازن الجسم"," التحكم في الهضم"],
"answer": " تنسيق التقلصات العضلية وضمان توازن الجسم"
},



{
"question": "7. ما هي وظيفة البصلة السيسائية؟",
"options": [" مركز للأفعال الانعكاسية الحيوية (تنفس، قلب."," تخزين المعلومات"," تنظيم الإحساس"],
"answer": " مركز للأفعال الانعكاسية الحيوية (تنفس، قلب."
},



{
"question": "8. ما هي وظيفة النخاع الشوكي؟",
"options": [" إنتاج الطاقة"," مركز للأفعال الانعكاسية الشوكية وطريق لنقل السيالة"," تحليل الغذاء"],
"answer": " مركز للأفعال الانعكاسية الشوكية وطريق لنقل السيالة"
},



{
"question": "9. ما هي وظيفة الأم الحنون؟",
"options": [" تغذية المراكز العصبية"," نقل الدم"," حماية العظام"],
"answer": " تغذية المراكز العصبية"
},



{
"question": "10. ما هي وظيفة السائل الدماغي الشوكي؟",
"options": [" إنتاج العصبونات"," حماية المراكز العصبية من الصدمات"," تنظيم الهرمونات"],
"answer": " حماية المراكز العصبية من الصدمات"
},



{
"question": "11. ما هي وظيفة الخلايا الدبقية؟",
"options": [" دعم وحماية وتغذية العصبونات"," إنتاج العضلات"," نقل السيالة العصبية"],
"answer": " دعم وحماية وتغذية العصبونات"
},



{
"question": "12. ما هي وظيفة غمد النخاعين؟",
"options": [" إنتاج الدم"," عزل الألياف العصبية كهربائياً"," زيادة التقلص العضلي"],
"answer": " عزل الألياف العصبية كهربائياً"
},



{
"question": "13. ما هي وظيفة هرمون النمو (GH.؟",
"options": [" تنظيم السكر"," ضبط نمو العظام والعضلات"," تنظيم النوم"],
"answer": " ضبط نمو العظام والعضلات"
},



{
"question": "14. ما هي وظيفة التيروكسين؟",
"options": [" زيادة الكالسيوم"," تنظيم درجة حرارة الجسم وإنتاج الطاقة"," خفض ضغط الدم"],
"answer": " تنظيم درجة حرارة الجسم وإنتاج الطاقة"
},



{
"question": "15. ما هي وظيفة الكالسيتونين؟",
"options": [" سحب الكالسيوم من العظام"," زيادة ترسيب الكالسيوم في العظام"," رفع سكر الدم"],
"answer": " زيادة ترسيب الكالسيوم في العظام"
},



{
"question": "16. ما هي وظيفة الباراثورمون؟",
"options": [" زيادة الطاقة"," تنظيم نسبة الكالسيوم في الدم"," خفض الكالسيوم في الدم"],
"answer": " تنظيم نسبة الكالسيوم في الدم"
},



{
"question": "17. ما هي وظيفة الأنسولين؟",
"options": [" خفض نسبة سكر العنب في الدم"," زيادة ضغط الدم"," رفع سكر الدم"],
"answer": " خفض نسبة سكر العنب في الدم"
},



{
"question": "18. ما هي وظيفة الأدرينالين؟",
"options": [" تنظيم النوم"," تحذير الجسم في حالات الخوف والخطر"," تهدئة الجسم"],
"answer": " تحذير الجسم في حالات الخوف والخطر"
},



{
"question": "19. ما هي وظيفة الميلاتونين؟",
"options": [" زيادة الهضم"," تنظيم الساعة البيولوجية (النوم واليقظة."," زيادة النشاط"],
"answer": " تنظيم الساعة البيولوجية (النوم واليقظة."
},



{
"question": "20. ما هي وظيفة الجهاز العصبي المحيطي؟",
"options": [" تخزين الكالسيوم"," إنتاج الهرمونات"," صلة الوصل بين المركزي ومختلف أعضاء الجسم"],
"answer": " صلة الوصل بين المركزي ومختلف أعضاء الجسم"
},


        ]
    }
}

# ================== بيانات المستخدم المؤقتة ==================
user_data = {}

# ================== START ==================
async def start(update: Update, context: ContextTypes.DEFAULT_TYPE):
    user_id = update.effective_user.id

    user = get_user(user_id)

    if not user:
        create_user(user_id)
        await update.message.reply_text("💰 البوت مدفوع\nاكتب /paid")
        return

    if not user.get("approved"):
        await update.message.reply_text("💰 البوت مدفوع\nاكتب /paid")
        return

    await update.message.reply_text("✨ نرحب بكم في منصة بوابة العلامة الكاملة ✨")

    keyboard = [
        [InlineKeyboardButton("🧬 علم الأحياء و الأرض", callback_data="bio")]
    ]

    await update.message.reply_text(
        "📚 اختر المادة:",
        reply_markup=InlineKeyboardMarkup(keyboard)
    )

# ================== الدفع ==================
async def paid(update: Update, context: ContextTypes.DEFAULT_TYPE):
    user_id = update.effective_user.id

    create_user(user_id)

    await context.bot.send_message(
        chat_id=ADMIN_ID,
        text=f"💳 طلب اشتراك:\n/approve {user_id}"
    )

    await update.message.reply_text("⏳ تم إرسال طلبك")

# ================== الموافقة ==================
async def approve(update: Update, context: ContextTypes.DEFAULT_TYPE):
    if update.effective_user.id != ADMIN_ID:
        return

    if not context.args:
        await update.message.reply_text("❌ أرسل ID")
        return

    user_id = int(context.args[0])

    approve_user(user_id)

    await update.message.reply_text(" تم التفعيل")
    await context.bot.send_message(chat_id=user_id, text="🎉 تم قبولك")

# ================== إرسال السؤال ==================
async def send_question(update: Update, context: ContextTypes.DEFAULT_TYPE):
    query = update.callback_query
    user_id = query.from_user.id
    chat_id = query.message.chat_id

    if user_id not in user_data:
        return

    subject = user_data[user_id]["subject"]
    category = user_data[user_id]["category"]
    index = user_data[user_id]["q_index"]

    q_list = subjects[subject][category]

    if index >= len(q_list):
        score = user_data[user_id]["score"]

        users.update_one(
            {"_id": user_id},
            {"$set": {"score": score}}
        )

        keyboard = [
            [InlineKeyboardButton("🔁 إعادة الاختبار", callback_data="start_quiz")]
        ]

        await context.bot.send_message(
            chat_id=chat_id,
            text=f"🎉 انتهيت!\n📊 نتيجتك: {score} من {len(q_list)*10}",
            reply_markup=InlineKeyboardMarkup(keyboard)
        )
        return

    q = q_list[index]

    keyboard = [
        [InlineKeyboardButton(opt, callback_data=str(i))]
        for i, opt in enumerate(q["options"])
    ]

    #  دعم الصور
    if q.get("type") == "image":
        await context.bot.send_photo(
            chat_id=chat_id,
            photo=uploaded_images[q["image"]],
            caption=q["question"],
            reply_markup=InlineKeyboardMarkup(keyboard)
        )
    else:
        text = q["question"] + "\n\n"

    for i, opt in enumerate(q["options"]):
        text += f"{chr(65+i)}- {opt}\n"

    await context.bot.send_message(
    chat_id=chat_id,
    text=text,
    reply_markup=InlineKeyboardMarkup(keyboard)
)


# ================== الأزرار ==================
async def button(update: Update, context: ContextTypes.DEFAULT_TYPE):
    query = update.callback_query
    await query.answer()

    user_id = query.from_user.id
    data = query.data

    # ================== اختيار المادة ==================
    if data == "bio":
        keyboard = [
            [InlineKeyboardButton("الوحدة 1", callback_data="bio_u1")]
        ]

        await context.bot.send_message(
            chat_id=query.message.chat_id,
            text="🧬 اختر الوحدة:",
            reply_markup=InlineKeyboardMarkup(keyboard)
        )
        return

    # ================== اختيار الوحدة ==================
    if data.startswith("bio_u"):
        unit = data.split("_")[1]

        user_data[user_id] = {
            "score": 0,
            "q_index": 0,
            "subject": "bio",
            "unit": unit
        }

        keyboard = [
            [InlineKeyboardButton("📘 تعليل", callback_data="taaleel")],
            [InlineKeyboardButton("🖼️ صور", callback_data="images")],
            [InlineKeyboardButton("📍 حدد موقع", callback_data="where")],
            [InlineKeyboardButton("📊 رتب مراحل", callback_data="level")],
            [InlineKeyboardButton("🧠 ماذا ينتج عن", callback_data="result1")],
            [InlineKeyboardButton("👍 ماهي وظيفة ", callback_data="function")]
        ]

        await context.bot.send_message(
            chat_id=query.message.chat_id,
            text="اختر نوع الأسئلة:",
            reply_markup=InlineKeyboardMarkup(keyboard)
        )
        return

    # ================== اختيار نوع الأسئلة ==================
    if data in ["taaleel", "images", "where", "level", "result1","function"]:

        if user_id not in user_data:
            await context.bot.send_message(
                chat_id=query.message.chat_id,
                text="❌ ابدأ من البداية /start"
            )
            return

        unit = user_data[user_id].get("unit")

        if not unit:
            await context.bot.send_message(
                chat_id=query.message.chat_id,
                text="❌ لم يتم تحديد الوحدة"
            )
            return

        category = f"{unit}_{data}"

        if category not in subjects["bio"]:
            await context.bot.send_message(
                chat_id=query.message.chat_id,
                text=f"❌ لا يوجد قسم: {category}"
            )
            return

        user_data[user_id]["category"] = category

        keyboard = [
            [InlineKeyboardButton("🎬 مشاهدة الفيديو التعليمي", callback_data="watch_video")],
            [InlineKeyboardButton("▶️ ابدأ الاختبار", callback_data="start_quiz")]
        ]

        await context.bot.send_message(
            chat_id=query.message.chat_id,
            text="📚 يمكنك الآن:",
            reply_markup=InlineKeyboardMarkup(keyboard)
        )
        return

    # ================== الفيديو ==================
    if data == "watch_video":
        await context.bot.send_video(
            chat_id=query.message.chat_id,
            video=INTRO_VIDEO
        )
        return

    if data == "start_quiz":
        await send_question(update, context)
        return 
# ================== الإجابة ==================
    if user_id not in user_data:
        return

    subject = user_data[user_id]["subject"]
    category = user_data[user_id]["category"]
    index = user_data[user_id]["q_index"]

    q = subjects[subject][category][index]
    selected = q["options"][int(data)]

    if selected == q["answer"]:
        user_data[user_id]["score"] += 10
        result = " صحيح"
    else:
        result = f"❌ خطأ\nالإجابة: {q['answer']}"

    user_data[user_id]["q_index"] += 1

    await context.bot.send_message(
        chat_id=query.message.chat_id,
        text=result
    )

    await asyncio.sleep(1)
    await send_question(update, context)

# ================== تشغيل البوت ==================
app = ApplicationBuilder().token(TOKEN).build()

app.add_handler(CommandHandler("start", start))
app.add_handler(CommandHandler("paid", paid))
app.add_handler(CommandHandler("approve", approve))
app.add_handler(CallbackQueryHandler(button))

if __name__ == "__main__":
    app.run_polling()
